docs/vcs/github.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-30 Wed 00:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting started with GitHub</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />

<link rel="stylesheet" type="text/css" href="../assets/style.min.css"/>


</head>
<body>
<div id="content">
<h1 class="title">Getting started with GitHub
<br />
<span class="subtitle">Department of Computer &amp; Information Science, Brooklyn College</span>
</h1>



<div id="outline-container-org004dcc3" class="outline-2">
<h2 id="org004dcc3">Getting started with GitHub</h2>
<div class="outline-text-2" id="text-org004dcc3">
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd24f967">What is GitHub?</a></li>
<li><a href="#orgef86f74">What is GitHub used for?</a></li>
<li><a href="#orgee977fa">How do you create a GitHub account?</a></li>
<li><a href="#orge56866d">How do I start using GitHub?</a></li>
<li><a href="#org160a4a8">How do I start a project with GitHub?</a></li>
<li><a href="#orge230b55">How do I work on an existing repository?</a></li>
<li><a href="#org73e967c">What is the workflow for using GitHub?</a></li>
<li><a href="#org5f662cb">Where can I get more help?</a></li>
</ul>
</li>
<li><a href="#glossary">Glossary</a></li>
<li><a href="#commands">Common Git Commands</a></div>
</div>

<div id="outline-container-orgd24f967" class="outline-4">
<h4 id="orgd24f967">What is GitHub?</h4>
<div class="outline-text-4" id="text-orgd24f967">
<p>
GitHub (<a href="https://github.com/">https://github.com/</a>) is a hosting platform for version control with collaborative features. It uses the Git version control technology.
</p>
</div>

<ul class="org-ul">
<li><a id="org9cdd0b1"></a>What is version control?<br />
<div class="outline-text-5" id="text-org9cdd0b1">
<p>
Version control systems (VCS) are used in managing revision control of project artifacts such as source code and documentation. VCS are used for maintaining a history of changes to each artifact. Artifacts can include documents, source code, and much more.
</p>


<p>
There are two main approaches to version control management systems. That is, they can either be centralized, or decentralized repositories. This page covers Git is a decentralized system.
</p>
</div>
</li>

<li><a id="org48a24aa"></a>Motivations for Source Version Control<br />
<div class="outline-text-5" id="text-org48a24aa">
<p>
Some of the motivations for version control include the following:
</p>

<ul class="org-ul">
<li>Keeping track of code</li>
<li>Storing versions of code changes</li>
<li>Restoring previous versions</li>
<li>Reviewing work history</li>
<li>Collaborating in a group</li>
<li>Backup</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgef86f74" class="outline-4">
<h4 id="orgef86f74">What is GitHub used for?</h4>
<div class="outline-text-4" id="text-orgef86f74">
<p>
GitHub is used for version control, which enables the ability for team collaboration on a single codebase. Often you&rsquo;ll see that open source software is published here, as there are other features such as star/fork/issues for others to collaborate on the project progress.
</p>
</div>
</div>


<div id="outline-container-orgee977fa" class="outline-4">
<h4 id="orgee977fa">How do you create a GitHub account?</h4>
<div class="outline-text-4" id="text-orgee977fa">
<p>
Go to <a href="https://github.com/join">https://github.com/join</a> in a web browser and fill in the form.
</p>
</div>
</div>

<div id="outline-container-orge56866d" class="outline-4">
<h4 id="orge56866d">How do I start using GitHub?</h4>
<div class="outline-text-4" id="text-orge56866d">
<p>
The first time you use GitHub (and the first time using GitHub with any new machine), you need to set up the SSH connection between your local machine and the GitHub server so that they know it&rsquo;s you publishing code to your account.
</p>

<p>
Follow the sections linked from this GitHub Documentation page <a href="https://docs.github.com/en/github/authenticating-to-github/connecting-to-github-with-ssh">Connecting to GitHub with SSH</a>. Don&rsquo;t blindly follow all the sections, start from the top and consider whether you need to move onto the next section.
</p>

<p>
Often times it&rsquo;s enough to use a single public key for most projects as you&rsquo;re starting out. This public key is often saved in the location `~/.ssh` The `~` symbol is called a tilde and it often signifies the home directory.
</p>
</div>
</div>

<div id="outline-container-org160a4a8" class="outline-4">
<h4 id="org160a4a8">How do I start a project with GitHub?</h4>
<div class="outline-text-4" id="text-org160a4a8">
<p>
<i>work in progress</i>
</p>
</div>
</div>


<div id="outline-container-orge230b55" class="outline-4">
<h4 id="orge230b55">How do I work on an existing repository?</h4>
<div class="outline-text-4" id="text-orge230b55">
<p>
<i>work in progress</i>
</p>
</div>
</div>


<div id="outline-container-org73e967c" class="outline-4">
<h4 id="org73e967c">What is the workflow for using GitHub?</h4>
<div class="outline-text-4" id="text-org73e967c">
<p>
<i>work in progress</i>
</p>
</div>
</div>

<div id="outline-container-org5f662cb" class="outline-4">
<h4 id="org5f662cb">Where can I get more help?</h4>
<div class="outline-text-4" id="text-org5f662cb">
<p>
GitHub publishes some guides on using GitHub effectively at <a href="https://guides.github.com/">https://guides.github.com/</a>
</p>

<p>
GitHub also maintains a GitHub.com Help Documentation at <a href="https://docs.github.com/en/github">https://docs.github.com/en/github</a>
</p>
</div>
</div>

<div id="outline-container-glossary" class="outline-3">
<h3 id="glossary">Glossary</h3>
<div class="outline-text-3" id="text-glossary">
<dl class="org-dl">
<dt>Workspace</dt><dd>this is where you have files you’re editing in a folder</dd>
<dt>Stage</dt><dd>this is where you put files or selected lines into an area to be given a commit message</dd>
<dt>Commit Log</dt><dd>a history of committed changes.</dd>
</dl>
</div>
</div>

<div id="outline-container-commands" class="outline-3">
<h3 id="commands">Common Git Commands</h3>
<div class="outline-text-3" id="text-commands">
<p>
Common basic workflow steps:
</p>

<ul class="org-ul">
<li><code>git add</code> moves the changes to the stage</li>
<li><code>git commit</code> logs the staged code</li>
<li><code>git push origin master</code> uploads the local master branch to server</li>
</ul>

<p>
Other common commands
git pull downloads latest version from server
</p>

<p>
(<code>git fetch</code> checks for changes but doesn’t download it)
</p>
<ul class="org-ul">
<li><code>git clone &lt;git address&gt;</code> copies a server version to locally</li>
<li><code>git remote -v</code> shows the server address</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-09-30 Wed 00:28</p>
</div>
</body>
</html>
